backend/load-tests/baseline_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/baseline_no_cache.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  01.0s/30.0s

running (0m02.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  02.0s/30.0s

running (0m03.0s), 03/10 VUs, 4 complete and 0 interrupted iterations
default   [  10% ] 03/10 VUs  03.0s/30.0s

running (0m04.0s), 04/10 VUs, 6 complete and 0 interrupted iterations
default   [  13% ] 04/10 VUs  04.0s/30.0s

running (0m05.0s), 05/10 VUs, 9 complete and 0 interrupted iterations
default   [  17% ] 05/10 VUs  05.0s/30.0s

running (0m06.0s), 06/10 VUs, 15 complete and 0 interrupted iterations
default   [  20% ] 06/10 VUs  06.0s/30.0s

running (0m07.0s), 07/10 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 07/10 VUs  07.0s/30.0s

running (0m08.0s), 08/10 VUs, 29 complete and 0 interrupted iterations
default   [  27% ] 08/10 VUs  08.0s/30.0s

running (0m09.0s), 09/10 VUs, 38 complete and 0 interrupted iterations
default   [  30% ] 09/10 VUs  09.0s/30.0s

running (0m10.0s), 09/10 VUs, 46 complete and 0 interrupted iterations
default   [  33% ] 09/10 VUs  10.0s/30.0s

running (0m11.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  11.0s/30.0s

running (0m12.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  12.0s/30.0s

running (0m13.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  13.0s/30.0s

running (0m14.0s), 10/10 VUs, 96 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  14.0s/30.0s

running (0m15.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  15.0s/30.0s

running (0m16.0s), 10/10 VUs, 121 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  16.0s/30.0s

running (0m17.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  17.0s/30.0s

running (0m18.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  18.0s/30.0s

running (0m19.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  19.0s/30.0s

running (0m20.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  20.0s/30.0s

running (0m21.0s), 10/10 VUs, 185 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  21.0s/30.0s

running (0m22.0s), 10/10 VUs, 197 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  22.0s/30.0s

running (0m23.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  23.0s/30.0s

running (0m24.0s), 10/10 VUs, 224 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  24.0s/30.0s

running (0m25.0s), 10/10 VUs, 237 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  25.0s/30.0s

running (0m26.0s), 10/10 VUs, 248 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  26.0s/30.0s

running (0m27.0s), 10/10 VUs, 261 complete and 0 interrupted iterations
default   [  90% ] 10/10 VUs  27.0s/30.0s

running (0m28.0s), 10/10 VUs, 274 complete and 0 interrupted iterations
default   [  93% ] 10/10 VUs  28.0s/30.0s

running (0m29.0s), 10/10 VUs, 287 complete and 0 interrupted iterations
default   [  97% ] 10/10 VUs  29.0s/30.0s

running (0m30.0s), 10/10 VUs, 303 complete and 0 interrupted iterations
default   [ 100% ] 10/10 VUs  30.0s/30.0s
time="2026-02-10T09:24:01+08:00" level=info msg="\n=== BASELINE TEST: NO CACHE ===" source=console
time="2026-02-10T09:24:01+08:00" level=info msg="ENABLE_RESPONSE_CACHE=false" source=console
time="2026-02-10T09:24:01+08:00" level=info msg="Random pages: 1-100" source=console
time="2026-02-10T09:24:01+08:00" level=info msg="\nHTTP Request Duration:" source=console
time="2026-02-10T09:24:01+08:00" level=info msg="  avg:  716.95ms" source=console
time="2026-02-10T09:24:01+08:00" level=error msg="TypeError: Cannot read property 'toFixed' of undefined or null\n\tat handleSummary (file:///C:/Users/hitech/Desktop/Full%20Stack%20React%20Project/AdminUI/AllDone-Ecommerce-Platform/ecommerce-platform/backend/load-tests/scenarios/baseline_no_cache.js:79:45(82))\n" hint="script exception"


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 626     20.305622/s
    checks_succeeded...: 100.00% 626 out of 626
    checks_failed......: 0.00%   0 out of 626

    ✓ status is 200
    ✓ has products

    CUSTOM
    cache_misses...................: 313    10.152811/s
    perf_db_ms.....................: avg=716.2ms  min=606ms    med=618ms    max=2.06s p(90)=775ms    p(95)=926.2ms 
    perf_total_ms..................: avg=716.21ms min=606ms    med=618ms    max=2.06s p(90)=775ms    p(95)=926.2ms 

    HTTP
    http_req_duration..............: avg=716.95ms min=606.18ms med=619.05ms max=2.07s p(90)=775.61ms p(95)=926.99ms
      { expected_response:true }...: avg=716.95ms min=606.18ms med=619.05ms max=2.07s p(90)=775.61ms p(95)=926.99ms
    http_req_failed................: 0.00%  0 out of 313
    http_reqs......................: 313    10.152811/s

    EXECUTION
    iteration_duration.............: avg=817.43ms min=706.25ms med=719.48ms max=2.17s p(90)=876.07ms p(95)=1.02s   
    iterations.....................: 313    10.152811/s
    vus............................: 10     min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 169 kB 5.5 kB/s
    data_sent......................: 52 kB  1.7 kB/s



running (0m30.8s), 00/10 VUs, 313 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  30s