backend/load-tests/cache_cold_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/cache_cold.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  01.0s/30.0s

running (0m02.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  02.0s/30.0s

running (0m03.0s), 03/10 VUs, 3 complete and 0 interrupted iterations
default   [  10% ] 03/10 VUs  03.0s/30.0s

running (0m04.0s), 04/10 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 04/10 VUs  04.0s/30.0s

running (0m05.0s), 05/10 VUs, 9 complete and 0 interrupted iterations
default   [  17% ] 05/10 VUs  05.0s/30.0s

running (0m06.0s), 06/10 VUs, 14 complete and 0 interrupted iterations
default   [  20% ] 06/10 VUs  06.0s/30.0s

running (0m07.0s), 07/10 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 07/10 VUs  07.0s/30.0s

running (0m08.0s), 08/10 VUs, 29 complete and 0 interrupted iterations
default   [  27% ] 08/10 VUs  08.0s/30.0s

running (0m09.0s), 09/10 VUs, 36 complete and 0 interrupted iterations
default   [  30% ] 09/10 VUs  09.0s/30.0s

running (0m10.0s), 10/10 VUs, 47 complete and 0 interrupted iterations
default   [  33% ] 10/10 VUs  10.0s/30.0s

running (0m11.0s), 10/10 VUs, 58 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  11.0s/30.0s

running (0m12.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  12.0s/30.0s

running (0m13.0s), 10/10 VUs, 84 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  13.0s/30.0s

running (0m14.0s), 10/10 VUs, 98 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  14.0s/30.0s

running (0m15.0s), 10/10 VUs, 115 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  15.0s/30.0s

running (0m16.0s), 10/10 VUs, 131 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  16.0s/30.0s

running (0m17.0s), 10/10 VUs, 145 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  17.0s/30.0s

running (0m18.0s), 10/10 VUs, 161 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  18.0s/30.0s

running (0m19.0s), 10/10 VUs, 172 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  19.0s/30.0s

running (0m20.0s), 10/10 VUs, 188 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  20.0s/30.0s

running (0m21.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  21.0s/30.0s

running (0m22.0s), 10/10 VUs, 212 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  22.0s/30.0s

running (0m23.0s), 10/10 VUs, 226 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  23.0s/30.0s

running (0m24.0s), 10/10 VUs, 239 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  24.0s/30.0s

running (0m25.0s), 10/10 VUs, 253 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  25.0s/30.0s

running (0m26.0s), 10/10 VUs, 267 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  26.0s/30.0s

running (0m27.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  90% ] 10/10 VUs  27.0s/30.0s

running (0m28.0s), 10/10 VUs, 294 complete and 0 interrupted iterations
default   [  93% ] 10/10 VUs  28.0s/30.0s

running (0m29.0s), 10/10 VUs, 306 complete and 0 interrupted iterations
default   [  97% ] 10/10 VUs  29.0s/30.0s

running (0m30.0s), 10/10 VUs, 322 complete and 0 interrupted iterations
default   [ 100% ] 10/10 VUs  30s
time="2026-02-10T09:28:19+08:00" level=info msg="\n=== CACHE COLD TEST ===" source=console
time="2026-02-10T09:28:19+08:00" level=info msg="ENABLE_RESPONSE_CACHE=true" source=console
time="2026-02-10T09:28:19+08:00" level=info msg="Random pages: 1-1000" source=console
time="2026-02-10T09:28:19+08:00" level=info msg="\nHTTP Request Duration:" source=console
time="2026-02-10T09:28:19+08:00" level=info msg="  avg:  660.64ms" source=console
time="2026-02-10T09:28:19+08:00" level=error msg="TypeError: Cannot read property 'toFixed' of undefined or null\n\tat handleSummary (file:///C:/Users/hitech/Desktop/Full%20Stack%20React%20Project/AdminUI/AllDone-Ecommerce-Platform/ecommerce-platform/backend/load-tests/scenarios/cache_cold.js:80:45(82))\n" hint="script exception"


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 664     21.532235/s
    checks_succeeded...: 100.00% 664 out of 664
    checks_failed......: 0.00%   0 out of 664

    ✓ status is 200
    ✓ has products

    CUSTOM
    cache_hits.....................: 25     0.810702/s
    cache_misses...................: 307    9.955416/s
    perf_db_ms.....................: avg=658.03ms min=0s       med=619ms    max=1.92s p(90)=776.9ms  p(95)=783.45ms
    perf_total_ms..................: avg=658.04ms min=0s       med=619ms    max=1.92s p(90)=776.9ms  p(95)=783.45ms

    HTTP
    http_req_duration..............: avg=660.64ms min=0s       med=623.71ms max=1.92s p(90)=780.34ms p(95)=795.13ms
      { expected_response:true }...: avg=660.64ms min=0s       med=623.71ms max=1.92s p(90)=780.34ms p(95)=795.13ms
    http_req_failed................: 0.00%  0 out of 332
    http_reqs......................: 332    10.766118/s

    EXECUTION
    iteration_duration.............: avg=765.56ms min=100.31ms med=730.99ms max=2.03s p(90)=886.54ms p(95)=898.88ms
    iterations.....................: 332    10.766118/s
    vus............................: 10     min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 157 kB 5.1 kB/s
    data_sent......................: 56 kB  1.8 kB/s



running (0m30.8s), 00/10 VUs, 332 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  30s